# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [1]:
# your answer here

import pandas as pd
import numpy as np
import scipy.stats as st

# Challenge 1

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [2]:
# your answer here

employee = pd.read_csv('data/Employee.csv')
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [6]:
# Method 1
# your answer here

mean_salary_by_department = employee.groupby('Department')['Salary'].mean()

print("Mean salary by department (using groupby):\n", mean_salary_by_department)

Mean salary by department (using groupby):
 Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

In [8]:
# Method 2
# your answer here

mean_salary_pivot = pd.pivot_table(employee, values='Salary', index='Department', aggfunc='mean')

print("Mean salary by department (using pivot tables):\n", mean_salary_pivot)

Mean salary by department (using pivot tables):
             Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [10]:
# your answer here

mean_salary_pivot_multi = pd.pivot_table(employee, values='Salary', index=['Department', 'Title'], aggfunc='mean')

mean_salary_pivot_multi

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [13]:
# your answer here

pivot_table_years = pd.pivot_table(employee, values=['Salary', 'Years'], index=['Title'], aggfunc={'Salary': 'mean', 'Years': 'mean'})
pivot_table_years

              Salary  Years
Title
VP         70.000000   8.00
analyst    32.500000   2.25
associate  56.666667   4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [14]:
# your answer here

department = employee.pivot_table(index=['Department','Title'], aggfunc={'Name':'count','Salary': 'mean'}).reset_index()
department

  Department      Title  Name  Salary
0         HR         VP     1    70.0
1         HR    analyst     2    32.5
2         IT         VP     1    70.0
3         IT    analyst     2    32.5
4         IT  associate     1    60.0
5      Sales  associate     2    55.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [15]:
# your answer here

calculations = employee.pivot_table(index=['Department', 'Title'], values=['Salary','Name'], aggfunc={'Salary': ['median', 'min','max','std',],'Name':'count'}).reset_index()
calculations

#NaN likely due to the fact that some groups have only one observation, 
#making it impossible to calculate the standard deviation.

  Department      Title  Name Salary
                        count    max median min       std
0         HR         VP     1     70   70.0  70       NaN
1         HR    analyst     2     35   32.5  30  3.535534
2         IT         VP     1     70   70.0  70       NaN
3         IT    analyst     2     35   32.5  30  3.535534
4         IT  associate     1     60   60.0  60       NaN
5      Sales  associate     2     55   55.0  55  0.000000

#### Based on your comments, fill the missing values with an appropriate value.

In [16]:
# your answer here

#We can fill in with 0

calculations[('Salary','std')] = calculations[('Salary','std')].fillna(0)
calculations

  Department      Title  Name Salary
                        count    max median min       std
0         HR         VP     1     70   70.0  70  0.000000
1         HR    analyst     2     35   32.5  30  3.535534
2         IT         VP     1     70   70.0  70  0.000000
3         IT    analyst     2     35   32.5  30  3.535534
4         IT  associate     1     60   60.0  60  0.000000
5      Sales  associate     2     55   55.0  55  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [17]:
# your answer here

department_summary = employee.groupby('Department').agg({'Name': 'count', 'Salary': 'sum'}).reset_index()

# Rename the columns for clarity
department_summary.columns = ['Department', 'Number of Employees', 'Total Salary Expenditure']

department_summary

  Department  Number of Employees  Total Salary Expenditure
0         HR                    3                       135
1         IT                    4                       195
2      Sales                    2                       110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [18]:
# your answer here

total_years = employee.pivot_table(index=['Department','Title'], values=['Years','Salary'], aggfunc={'Years': 'sum', 'Salary':'mean'}).reset_index()
total_years

  Department      Title  Salary  Years
0         HR         VP    70.0      8
1         HR    analyst    32.5      6
2         IT         VP    70.0      8
3         IT    analyst    32.5      3
4         IT  associate    60.0      7
5      Sales  associate    55.0      5

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [ ]:
# your answer here

def mean_without_max(series):
    max_salary = series.max()
    return series[series < max_salary].mean()

# Using pivot_table to calculate mean salary after removing the maxima for each department
pivot_table_mean_without_max = pd.pivot_table(
    employee,
    values='Salary',
    index='Department',
    aggfunc=mean_without_max
).reset_index()

# Rename the columns for clarity
pivot_table_mean_without_max.columns = ['Department', 'Mean Salary (After Removing Max)']

pivot_table_mean_without_max

# Challenge 2

#### Open the ` Fitbit.csv` file and name your dataset `fitbit`.

In [ ]:
# your answer here

#### Explore you dataset in terms of data types and descriptive statistics.
Hint: Use Pandas functions from previous lectures.

In [ ]:
# your answer here

In [ ]:
# your answer here

#### You suspect that there must be a linear relationship between the Minutes Very Active and the Steps. Compute the correlation between these variables.

In [ ]:
# your answer here

#### Use matplotlib to visually plot Minutes Very active vs Steps. 

##### Hint : import matplotlib.pyplot as plt (See previous lessons)#####
- Use plt.scatter(x=df['col_name_1'], y=df['col_name_2'])

In [ ]:
# your answer here

#### What can you say about Minute Very Active and Steps? Write a comment below

In [ ]:
# your answer here

#### We also suspect that there must be a linear relationship between the Minutes Sedentary and the Steps. Compute the correlation between these variables.

In [ ]:
# your answer here

#### Use matplotlib to visually plot Minutes Sedentary vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [ ]:
# your answer here

#### We also suspect that there must be a linear relationship between the MinutesOfSleep and the Steps. Compute the correlation between these variables.

In [ ]:
# your answer here

#### Use matplotlib to visually plot MinutesOfSleep vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [ ]:
# your answer here

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`
column= ['Calorie burned', 'Steps','Floors','Minutes Sedentary','Minutes Very Active', 'MinutesOfSleep']

In [ ]:
# your answer here

#### Based on the result of the correlation matrix. What are the highly correlated features with the variable Steps?
*Hint: From the results above select the variable Steps and order your results in descending order (use Pandas sort_values function)*

In [ ]:
# your answer here

# Challenge 3

#### Open the `Time_Grades.csv` file and name your dataset `time_grades`.

In [ ]:
# your answer here

#### Show visually the frequency distribution of the time_grades dataset.

In [ ]:
# your answer here

#### Is there a correlation between study time and Grade? Use both Pearson and Spearman correlation and comment your results.

In [ ]:
# your answer here

#### Use matplotlib to visually plot Study time vs Grade. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [ ]:
# your answer here

#### Could you explain the difference between Pearson and Spearman correlation? (see References in README.md)

In [ ]:
# your answer here